app/controllers/member_accounts_controller.rb

  def index
    @member_accounts = MemberAccount.all
---
SELECT "member_accounts".* FROM "member_accounts"

  def create
    @member_account = MemberAccount.new(member_account_params)

    respond_to do |format|
      if @member_account.save
---
INSERT INTO "member_accounts" ("first_name", "last_name", "age", "date_of_birth", "gender", "address", "marital_status", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @member_account.update(member_account_params)
---
UPDATE "member_accounts" SET "gender" = ?, "updated_at" = ? WHERE "member_accounts"."id" = ?  [["gender", "Female"], ["updated_at", "2020-11-20 18:37:24.364838"], ["id", 2]]

  def destroy
    @member_account.destroy
---
DELETE FROM "member_accounts" WHERE "member_accounts"."id" = ?  [["id", 1]]

    def set_member_account
      @member_account = MemberAccount.find(params[:id])
---
SELECT "member_accounts".* FROM "member_accounts" WHERE "member_accounts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]